{
  "pages": {
    "index": {
      "title": "Alder Velasquez: Personal Site",
      "description": "Alder Velasquez: Developer, Photographer, and Gamer...",
      "coverImage": "https://images.unsplash.com/photo-1668026067701-48b0b7dbdc47?w=1200&q=75",
      "subtitle": {
        "uperTitle": "The personal site of",
        "bottomTitle": "Alder Velasquez"
      },
      "roles": [
        {
          "role": "👩‍💻 Developer"
        },
        {
          "role": "📸 Photographer"
        },
        {
          "role": "🎮 Gamer"
        }
      ],
      "subDescription": "Full-Stack developer from Spain",
      "about": {
        "title": "My name is Alder, and I am a passionate cross-platform developer based in Spain. My journey into the world of technology began early in life and has been defined by curiosity, determination, and a relentless drive to learn and grow.",
        "content": "Born in Jinotepe, Nicaragua, I moved to Spain in 2010, where my love for computers and programming truly flourished. Over the years, I have worked hard to turn this passion into a career, graduating as a Cross-Platform Application Developer in 2021. Since then, I have been honing my skills as a BackEnd-oriented developer at CIC, where I specialize in creating robust and innovative solutions."
      },
      "milestones": [
        {
          "date": "2000",
          "text": "Born in Jinotepe, Nicaragua."
        },
        {
          "date": "2010",
          "text": "Moved to Spain, where I discovered my passion for technology."
        },
        {
          "date": "2021",
          "text": "Graduated as a Cross-Platform Application Developer."
        },
        {
          "date": "Present",
          "text": "Working at CIC as a BackEnd-oriented developer, constantly learning and improving."
        }
      ]

    },
    "about": {
      "title": "About | Alder Velasquez",
      "description": "About Alder Velasquez",
      "content": [
        {
          "text": "My name is Alder, and I come from Nicaragua. Ever since I was a child, I have been fascinated by computers. I loved exploring how they worked, tinkering with hardware, and experimenting with software. This curiosity and passion for technology only grew as I got older."
        },
        {
          "text": "When I moved to Spain and completed my secondary education (ESO), I was absolutely certain about my career path. I decided to pursue a Vocational Training Intermediate Level and later an Advanced Level in IT, with a specific focus on programming and software development. These formative years solidified my love for coding and equipped me with a strong foundation in computer science."
        },
        {
          "text": "After finishing my studies, I began my professional career at CIC, where I continue to work to this day. CIC has been the cornerstone of my professional development. It is where I have learned most of what I know about software engineering, DevOps practices, and cutting-edge technologies. My time at CIC has been invaluable in shaping me into the professional I am today. I constantly strive to expand my knowledge, whether by exploring topics like Large Language Models (LLMs), delving into hardware innovations, or keeping up with emerging trends in the tech industry."
        },
        {
          "text": "Beyond my professional life, I am a firm believer in continuous self-improvement. I dedicate time to learning new skills and exploring areas outside my comfort zone. Additionally, I enjoy indulging in hobbies that allow me to express creativity and relax, such as photography and gaming. These activities not only bring me joy but also inspire me to think creatively in my work."
        },
        {
          "text": "In summary, I am a passionate technologist who thrives on learning and building innovative solutions. My journey from a curious child in Nicaragua to a dedicated professional at CIC is a testament to my commitment to growth and my love for technology."
        }
      ]
    }
  },
  "components": {
    "Footer": {
      "owner": "Alder Velasquez"
    },
    "MainHead": {
      "title": "Alder Velasquez: Personal Site",
      "description": "The personal site of Alder Velasquez"
    },
    "Nav": {
      "monogram": "AD",
      "socials": {
        "twitter": "https://twitter.com/TheMaxPrain",
        "instagram": "https://www.instagram.com/ad.vo2/",
        "github": "https://github.com/MaxPrain12"
      }
    }
  }
}